src/Documents/ИТСервисы_ФормированиеКомандыПроекта/ИТСервисы_ФормированиеКомандыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ФормированиеКомандыПроекта</name>
  <registerRecords>InformationRegister.ИТСервисы_КомандыПроектов</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВКоманде</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыделяемыйПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ИТСервисы_ФормированиеКомандыПроекта/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Сотрудник") Тогда	
		СтандартнаяОбработка = Ложь;	
		НоваяСтрока = Объект.Участники.Добавить();
		НоваяСтрока.Сотрудник = ВыбранноеЗначение.Сотрудник;
		НоваяСтрока.РольВКоманде = ВыбранноеЗначение.Роль;
		Элементы.Участники.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элементы.Участники.ТекущийЭлемент = Элементы.УчастникиВыделяемыйПроцент;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ИТСервисы_ФормированиеКомандыПроекта.Форма.ФормаПодбора", 
		ПараметрыФормы, 
		Элементы.Участники);	
КонецПроцедуры
